<!-- dflook/terraform-github-actions {"workspace":"dev","backend":"bb41774fa9b9e87187acc3dea0a8ce2a993d3883977d6fffd2397ee2d1133ad4","backend_type":"azurerm"} -->
Terraform plan in __./terraform__ in the __dev__ workspace
<details>
<summary>Plan: 3 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "gha-demo"
    }

  # null_resource.demo will be created
  + resource "null_resource" "demo" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

  # random_uuid.uuid will be created
  + resource "random_uuid" "uuid" {
      + id     = (known after apply)
      + result = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```
</details>

:x: Error applying plan in [terraform #13](https://github.com/hybridaccess/gha-demo/actions/runs/2619190836)